urbanFlow/sRiver/rans/winter/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;
vertices ( (-1423.9080859267851 -1421.1981607452035 0) (3559.770214816963 -1421.1981607452035 0) (3559.770214816963 1421.1981607452035 0) (-1423.9080859267851 1421.1981607452035 0) (-1423.9080859267851 -1421.1981607452035 160.5) (3559.770214816963 -1421.1981607452035 160.5) (3559.770214816963 1421.1981607452035 160.5) (-1423.9080859267851 1421.1981607452035 160.5) );
blocks ( hex (0 1 2 3 4 5 6 7) (50 40 20) simpleGrading (1 1 1) );
boundary ( 
    inlet { type patch; faces ((0 3 7 4)); } 
    outlet { type patch; faces ((1 5 6 2)); } 
    ground { type wall; faces ((0 1 2 3)); } 
    frontAndBack { type symmetry; faces ((0 4 5 1) (3 2 6 7)); } 
    sky { type patch; faces ((4 5 6 7)); } 
);